# # Add/remove column(s) to/from dataframe

In [1]:
import pandas as pd

In [2]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

In [4]:
df_students = pd.DataFrame(students_score)

df_students

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 1. Using concat

In [6]:
df_students_2 = pd.DataFrame({"Name" : "Annika", "Score" : [99]})

In [10]:
df_students_3 = pd.concat([df_students, df_students_2], ignore_index=True)

In [11]:
df_students_3

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82
7    Annika     99

## 2. Using Append

In [15]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

df_students_1 = pd.DataFrame(students_score)

df_students_1

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [16]:
row_student_add = {"Name" : "Robert", "Score" : [90]}

In [17]:
df_students_1 = df_students.append(row_student_add, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

## 3. Using iloc

In [18]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

df_students_1 = pd.DataFrame(students_score)

df_students_1

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [19]:
df_students_1.iloc[0] = ['Archie', 89]

In [20]:
df_students_1

       Name  Score
0    Archie     89
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 4. Using loc

In [21]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

df_students_1 = pd.DataFrame(students_score)

df_students_1

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [22]:
df_students_1.loc[2] = ['Robert', 90]

In [23]:
df_students_1

       Name  Score
0      Paul     98
1     Aaron     89
2    Robert     90
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 5. Remove rows

In [36]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

df_students_1 = pd.DataFrame(students_score)

df_students_1

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [33]:
df_students_1.drop([0, 1], inplace=True)
df_students_1.reset_index(drop=True)

       Name  Score
0    Krista     99
1  Veronica     87
2    Paxton     90
3   Madison     83
4    Aurora     82

Useful method

In [ ]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
}

df_students_1 = pd.DataFrame(students_score)

df_students_1

In [38]:
df_students_1_under_90 = df_students_1[df_students_1['Score'] < 90]

In [39]:
df_students_1_under_90.index

Index([3, 5, 6], dtype='int64')

In [40]:
df_students_1.drop(df_students_1_under_90.index)

     Name  Score
2  Krista     99
4  Paxton     90

One liner equavalent

In [41]:
df_students_1.drop(df_students_1[df_students_1['Score'] < 90].index)

     Name  Score
2  Krista     99
4  Paxton     90